$(function () {

	init()


	function init() {

		// 多行文本省略
		const desc_list = $('.form_container .desc');
		for (let i = 0; i < desc_list.length; i++) {
			const element = desc_list[i];

			$clamp(element, { clamp: 2 });
		}

		//自动取时间线宽度
		const line_width = $('.region')[0].clientWidth;
		const mainDiv = $('#main');
		mainDiv.css('width', `${line_width}px`);




	}






})

//文章展示Vue
const showArt = new Vue({
	el: '#show-content-box',
	data: {
		show: false,
		article_list: [
			{
				"id": "207",
				"title": "味仓茶园2017多出来的",
				"year": "2017",
				"month": "OCT",
				"day": "12",
				"cover_img": "/drupal/sites/t-matrix2/files/2021-07/cover-img_9.jpg",
				"article_content": "<p>味仓茶园2017多出来的味仓茶园2017多出来的味仓茶园2017多出来的味仓茶园2017多出来的味仓茶园2017多出来的味仓茶园2017多出来的味仓茶园2017多出来的味仓茶园2017多出来的味仓茶园2017多出来的味仓茶园2017多出来的</p>\n"
			},
			{
				"id": "200",
				"title": "味仓茶园201705",
				"year": "2017",
				"month": "MAY",
				"day": "11",
				"cover_img": "/drupal/sites/t-matrix2/files/2021-07/cover-img_3.jpg",
				"article_content": "<p>味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,</p>\n"
			},
			{
				"id": "199",
				"title": "味仓茶园201704",
				"year": "2017",
				"month": "APR",
				"day": "04",
				"cover_img": "/drupal/sites/t-matrix2/files/2021-07/cover-img_2.jpg",
				"article_content": "<p>味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,</p>\n"
			},
			{
				"id": "198",
				"title": "味仓茶园201703",
				"year": "2017",
				"month": "MAR",
				"day": "03",
				"cover_img": "/drupal/sites/t-matrix2/files/2021-07/cover-img_1.jpg",
				"article_content": "<p>味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,</p>\n"
			},
			{
				"id": "197",
				"title": "味仓茶园201702",
				"year": "2017",
				"month": "FEB",
				"day": "02",
				"cover_img": "/drupal/sites/t-matrix2/files/2021-07/cover-img_0.jpg",
				"article_content": "<p>味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702</p>\n"
			},
			{
				"id": "196",
				"title": "味仓茶园201701",
				"year": "2017",
				"month": "JUNE",
				"day": "01",
				"cover_img": "/drupal/sites/t-matrix2/files/2021-07/cover-img.jpg",
				"article_content": "<p>味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701</p>\n"
			}
		]
	},
	methods: {
		hide: function () {
			$("#show-content-box").removeClass('show');
			$("#show-content-box").addClass('hide');

		},
		toArticle: function (id) {
			if (id != -1) {
				const current_art = this.$refs[`article_${id}`][0];
				console.log("current_art: ", current_art);
				this.toHeight(current_art.offsetTop - 20);
			}
		},
		toHeight: function (height) {
			const _height = isNaN(Number(height)) ? -1 : Number(height);
			if (_height != -1) {
				//滚动条滚动到文章的位置
				const contentView = this.$refs['contentView'];
				contentView.scrollTo(0, height);
			}
		}
	}
})


function foldArticleToggle(e) {
	const aContent = e.previousSibling.previousSibling;
	if (aContent) {
		if (aContent.dataset.fold == '1') {
			aContent.style.height = '300px';
			e.innerHTML = '[收起]';
			$clamp(aContent, { clamp: 99 });
			aContent.dataset.fold = '0';
		} else {
			aContent.style.height = '110px';
			$clamp(aContent, { clamp: 4 });
			aContent.dataset.fold = '1';
			e.innerText = '[展开]';
		}

	}

}

function initArticle(id) {

	//由VUE生命周期缘由，需要定时器滞后执行以下代码
	setTimeout(() => {
		//文章初始-多行文本省略
		const article_list = $('.article-content');
		for (let i = 0; i < article_list.length; i++) {
			const element = article_list[i];
			$clamp(element, { clamp: 4 });
		}

		//滚动到某个文
		showArt.toArticle(id);
	}, 0)
}

function ShowArticle(year, _id) {
	//e.g http://t-matrix.ruuuun.com/drupal/json/fwbs?_format=json&year=2017
	let id = _id;
	console.log('year', year);
	console.log('id', id);

	showArt.show = true;
	setTimeout(() => {
		$("#show-content-box").removeClass('hide');
		$("#show-content-box").addClass('show');
		$("#show-content-box").css('display', 'block');
		initArticle(id);
	}, 0)

	// if (!id) {
	// 	//如果不指定id 则从第一篇文章开始
	// 	id = -1;
	// }
	// if (year) {
	// 	//优先读取缓存
	// 	const _cacheList = window.localStorage.getItem(`list_${year}`)
	// 	if (_cacheList) {
	// 		showArt.article_list = JSON.parse(_cacheList);
	// 		showArt.show = true;
	// 		initArticle(id);

	// 	} else {
	// 		//初始读取数据库
	// 		$.ajax({
	// 			url: `/drupal/json/fwbs?_format=json&year=${year}`,
	// 			type: "get",
	// 			success: function (res) {
	// 				console.log(res);
	// 				showArt.article_list = res;
	// 				showArt.show = true;
	// 				if (res) {
	// 					window.localStorage.setItem(`list_${year}`, JSON.stringify(res));
	// 				}
	// 				initArticle(id);
	// 			},
	// 			fail: function () {
	// 				console.log("get airticle info fail")
	// 				alert('网络错误，请刷新重试');
	// 			}
	// 		});


	// 	}
	// }
}


