$(function () {

	init()


	function init() {

		// 多行文本省略
		const desc_list = $('.form_container .desc');
		for (let i = 0; i < desc_list.length; i++) {
			const element = desc_list[i];

			$clamp(element, { clamp: 2 });
		}


		//自动取时间线宽度
		const line_width = $('.region')[0].clientWidth;
		const mainDiv = $('#main');
		mainDiv.css('width', `${line_width}px`);

		//叶片高度修正
		const ypHeight = $('.region')[0].clientWidth;
		const yplist = $(".item-list");
		for (let i = 0; i < yplist.length; i++) {
			const element = yplist[i];
			// element.css('height', mainDiv.css('height') * 0.547)
			element.style.width = mainDiv[0].clientHeight * 0.547 + mainDiv[0].clientHeight * 0.547 * 0.457 + 'px';
			element.style.height = mainDiv[0].clientHeight * 0.547 + 'px';
			// element.style.marginRight = mainDiv[0].clientHeight * 0.547 * 0.457 + 'px';
		}

		//叶片覆盖内容宽修正


		//固定层高度修正
		$("#fixedBox").css('height', mainDiv.css('height'));




	}







})

//文章展示Vue
const showArt = new Vue({
	el: '#show-content-box',
	data: {
		show: false,
		article_list: [
			{
				"id": "207",
				"title": "味仓茶园2017多出来的",
				"year": "2017",
				"month": "OCT",
				"day": "12",
				"cover_img": "/drupal/sites/t-matrix2/files/2021-07/cover-img_9.jpg",
				"article_content": "<p>味仓茶园2017多出来的味仓茶园2017多出来的味仓茶园2017多出来的味仓茶园2017多出来的味仓茶园2017多出来的味仓茶园2017多出来的味仓茶园2017多出来的味仓茶园2017多出来的味仓茶园2017多出来的味仓茶园2017多出来的</p>\n"
			},
			{
				"id": "200",
				"title": "味仓茶园201705",
				"year": "2017",
				"month": "MAY",
				"day": "11",
				"cover_img": "/drupal/sites/t-matrix2/files/2021-07/cover-img_3.jpg",
				"article_content": "<p>味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,</p>\n"
			},
			{
				"id": "199",
				"title": "味仓茶园201704",
				"year": "2017",
				"month": "APR",
				"day": "04",
				"cover_img": "/drupal/sites/t-matrix2/files/2021-07/cover-img_2.jpg",
				"article_content": "<p>味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,</p>\n"
			},
			{
				"id": "198",
				"title": "味仓茶园201703",
				"year": "2017",
				"month": "MAR",
				"day": "03",
				"cover_img": "/drupal/sites/t-matrix2/files/2021-07/cover-img_1.jpg",
				"article_content": "<p>味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,</p>\n"
			},
			{
				"id": "197",
				"title": "味仓茶园201702",
				"year": "2017",
				"month": "FEB",
				"day": "02",
				"cover_img": "/drupal/sites/t-matrix2/files/2021-07/cover-img_0.jpg",
				"article_content": "<p>味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702</p>\n"
			},
			{
				"id": "196",
				"title": "味仓茶园201701",
				"year": "2017",
				"month": "JUNE",
				"day": "01",
				"cover_img": "/drupal/sites/t-matrix2/files/2021-07/cover-img.jpg",
				"article_content": "<p>味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701</p>\n"
			}
		]
	},
	methods: {
		hide: function () {
			$("#show-content-box").removeClass('show');
			$("#show-content-box").addClass('hide');
			$("#fixedBox").css('opacity', '0');
			setTimeout(function () {

				$("#fixedBox").css('z-index', '-1');
				const article_list = $('.article-content');
				for (let i = 0; i < article_list.length; i++) {
					const element = article_list[i];
					element.style.height = '110px';
					$clamp(element, { clamp: 4 });
					element.dataset.fold = '1';
				}
				const btn_list = $(".fold-btn");
				for (let i = 0; i < btn_list.length; i++) {
					const element = btn_list[i];
					element.innerText = '[展开]';
				}

			}, 500)
		},
		toArticle: function (id) {
			if (id != -1) {
				const current_art = this.$refs[`article_${id}`][0];
				console.log("current_art: ", current_art);
				this.toHeight(current_art.offsetTop - 20);
			}
		},
		toHeight: function (height) {
			const _height = isNaN(Number(height)) ? -1 : Number(height);
			if (_height != -1) {
				//滚动条滚动到文章的位置
				const contentView = this.$refs['contentView'];
				contentView.scrollTo(0, height);
			}
		}
	}
})


function foldArticleToggle(e) {
	const aContent = e.previousSibling.previousSibling;
	if (aContent) {
		if (aContent.dataset.fold == '1') {
			aContent.style.height = '300px';
			e.innerHTML = '[收起]';
			$clamp(aContent, { clamp: 99 });
			aContent.dataset.fold = '0';
		} else {
			aContent.style.height = '110px';
			$clamp(aContent, { clamp: 4 });
			aContent.dataset.fold = '1';
			e.innerText = '[展开]';
		}

	}

}

function initArticle(id) {

	//由VUE生命周期缘由，需要定时器滞后执行以下代码
	setTimeout(() => {
		//文章初始-多行文本省略
		const article_list = $('.article-content');
		for (let i = 0; i < article_list.length; i++) {
			const element = article_list[i];
			$clamp(element, { clamp: 4 });
		}

		//滚动到某个文
		showArt.toArticle(id);
	}, 0)
}

const MonthMap = {
	0: {
		en: "JAN",
		num: "01"
	},
	1: {
		en: "FEB",
		num: "02"
	},

	2: {
		en: "MAR",
		num: "03"
	},
	3: {
		en: "APR",
		num: "04"
	},
	4: {
		en: "MAY",
		num: "05"
	},
	5: {
		en: "JUN",
		num: "06"
	},
	6: {
		en: "JUL",
		num: "07"
	},

	7: {
		en: "AUG",
		num: "08"
	},

	8: {
		en: "SEPT",
		num: "09"
	},

	9: {
		en: "OCT",
		num: "10"
	},
	10: {
		en: "NOV",
		num: "11"
	},
	11: {
		en: "DEC",
		num: "12"
	},

}

//格式化文章数据，按月分组
function formatData(rows) {
	let res = [];

	if (Array.isArray(rows) && rows.length) {
		let _monthKeys = {};

		rows.map((row, key) => {
			//row.date = "2017-10-12";
			const month = new Date(row.date).getMonth();
			if (!_monthKeys[month]) {
				_monthKeys[month] = [];
			}

			_monthKeys[month].push(row);

		});

		if (Object.keys(_monthKeys).length) {
			let hadMonthObj = {};

			for (let month in MonthMap) {

				console.log(month);

				_monthKeys[month] != undefined && _monthKeys[month].map((dayRow) => {

					res.push({
						"id": dayRow.id,
						"title": dayRow.title,
						"year": dayRow.year,
						"month": hadMonthObj[month] ? "" : MonthMap[new Date(dayRow.date).getMonth()]['en'],
						"day": hadMonthObj[month] ? "" : MonthMap[new Date(dayRow.date).getMonth()]['num'],
						"cover_img": dayRow.cover_img,
						"article_content": dayRow.article_content,
					})

					//标记已经记录该月
					if (!hadMonthObj[month]) {
						hadMonthObj[month] = true;
					}

				})
			}
		}


	}

	return res;
}

function ShowArticle(year, _id) {
	//e.g http://t-matrix.ruuuun.com/drupal/json/fwbs?_format=json&year=2017
	let id = _id;
	console.log('year', year);
	console.log('id', id);

	showArt.show = true;
	showArt.article_list = formatData(mock_data);

	setTimeout(() => {
		// const offsetLeft = $(".fwbs-main")[0].offsetLeft;
		// const vw50 = document.clientWidth;
		// if (offsetLeft < 0) {
		// 	$("#show-content-box").css('left', `calc(${offsetLeft}px + 50vw)`);
		// } else {
		// 	$("#show-content-box").css('left', `50vw`);
		// }
		$("#fixedBox").css('z-index', '9999');
		$("#fixedBox").css('opacity', '1');
		$("#show-content-box").removeClass('hide');
		$("#show-content-box").addClass('show');
		$("#show-content-box").css('display', 'block');


		initArticle(id);
		window.scrollTo(0, 0)
	}, 0)

	// if (!id) {
	// 	//如果不指定id 则从第一篇文章开始
	// 	id = -1;
	// }
	// if (year) {
	// 	//优先读取缓存
	// 	const _cacheList = window.localStorage.getItem(`list_${year}`)
	// 	if (_cacheList) {
	// 		showArt.article_list = JSON.parse(_cacheList);
	// 		showArt.show = true;
	// 		initArticle(id);

	// 	} else {
	// 		//初始读取数据库
	// 		$.ajax({
	// 			url: `/drupal/json/fwbs?_format=json&year=${year}`,
	// 			type: "get",
	// 			success: function (res) {
	// 				console.log(res);
	// 				showArt.article_list = res;
	// 				showArt.show = true;
	// 				if (res) {constiiiiiiiiiIiiiiiiiiiiiiijkkkkjk
	// 					window.localStorage.setItem(`list_${year}`, JSON.stringify(res));
	// 				}
	// 				initArticle(id);
	// 			},
	// 			fail: function () {
	// 				console.log("get airticle info fail")
	// 				alert('网络错误，请刷新重试');
	// 			}
	// 		});


	// 	}
	// }
}


const mock_data = [
	{
		"id": "207",
		"title": "味仓茶园2017多出来的",
		"year": "2017",
		"month": "OCT",
		"day": "12",
		"cover_img": "/drupal/sites/t-matrix2/files/2021-07/cover-img_9.jpg",
		"article_content": "<p>味仓茶园2017多出来的味仓茶园2017多出来的味仓茶园2017多出来的味仓茶园2017多出来的味仓茶园2017多出来的味仓茶园2017多出来的味仓茶园2017多出来的味仓茶园2017多出来的味仓茶园2017多出来的味仓茶园2017多出来的</p>\n",
		"date": "2017-10-12"
	},
	{
		"id": "200",
		"title": "味仓茶园201705",
		"year": "2017",
		"month": "MAY",
		"day": "11",
		"cover_img": "/drupal/sites/t-matrix2/files/2021-07/cover-img_3.jpg",
		"article_content": "<p>味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,味仓茶园201705,</p>\n",
		"date": "2017-10-11"
	},
	{
		"id": "199",
		"title": "味仓茶园201704",
		"year": "2017",
		"month": "APR",
		"day": "04",
		"cover_img": "/drupal/sites/t-matrix2/files/2021-07/cover-img_2.jpg",
		"article_content": "<p>味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,味仓茶园201704,</p>\n",
		"date": "2017-04-04"
	},
	{
		"id": "198",
		"title": "味仓茶园201703",
		"year": "2017",
		"month": "MAR",
		"day": "03",
		"cover_img": "/drupal/sites/t-matrix2/files/2021-07/cover-img_1.jpg",
		"article_content": "<p>味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,味仓茶园201703,</p>\n",
		"date": "2017-03-03"
	},
	{
		"id": "197",
		"title": "味仓茶园201702",
		"year": "2017",
		"month": "FEB",
		"day": "02",
		"cover_img": "/drupal/sites/t-matrix2/files/2021-07/cover-img_0.jpg",
		"article_content": "<p>味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702,味仓茶园201702</p>\n",
		"date": "2017-02-02"
	},
	{
		"id": "196",
		"title": "味仓茶园201701",
		"year": "2017",
		"month": "JUNE",
		"day": "01",
		"cover_img": "/drupal/sites/t-matrix2/files/2021-07/cover-img.jpg",
		"article_content": "<p>味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701味仓茶园201701</p>\n",
		"date": "2017-01-01"
	}
]
